Repository: ericbroska/Pixen
Catalog: *.lproj/Localizable.strings
Languages: ru

# BACKGROUND_LABEL
source: Background
ru: Фон

# BACKGROUND_TOOLTIP
source: Open background configurator
ru: Показать параметры фона

# LAYERS_LABEL
source: Layers
ru: Слои

# LAYERS_TOOLTIP
source: Open and close the layer view drawer
ru: Показать/спрятать список слоёв в документе

# PREVIEW_LABEL
source: Preview
ru: Предпросмотр

# PREVIEW_TOOLTIP
source: Open and close the preview panel
ru: Открыть или закрыть панель предпросмотра для этого документа

# TOOL_PROPERTIES_LABEL
source: Tool Properties
ru: Настройки инструмента

# TOOL_PROPERTIES_TOOLTIP
source: Open and close the tool properties panel
ru: Показать/спрятать панель настроек текущего инструмента

# GRID_LABEL
source: Grid
ru: Сетка

# GRID_TOOLTIP
source: Show the grid settings
ru: Показать параметры сетки

# COLOR_PALETTE_LABEL
source: Palette
ru: Палитра

# COLOR_PALETTE_TOOLTIP
source: Open and close the color palette
ru: Показать/спятать цветовую палитру

# ZOOM_FIT_LABEL
source: Zoom Fit
ru: Подогнать размер

# ZOOM_FIT_TOOLTIP
source: Zoom the canvas to fit the window
ru: Подогнать размеры холста под размер экрана

# ZOOM_ACTUAL_LABEL
source: Actual Size
ru: Действительный размер

# ZOOM_ACTUAL_TOOLTIP
source: Zoom to the actual size of the image
ru: Восстановить оригинальный масштаб изображения

# SCALE_LABEL
source: Scale
ru: Масштабирование

# SCALE_TOOLTIP
source: Scale the image
ru: Масштабировать изображение

# RESIZE_LABEL
source: Resize
ru: Размеры

# RESIZE_TOOLTIP
source: Resize the canvas
ru: Изменить размеры холста

# ZOOM_LABEL
source: Zoom
ru: Увеличение

# ZOOM_TOOLTIP
source: Modify the zoom percentage of the zoom
ru: Изменить процент увеличения изображения

source: New Animation
ru: Новая анимация

# ANIMATION_SIZE_PROMPT
source: Specify the size of the animation.
ru: Укажите размеры кадра анимации

# BACKGROUNDS_SAVE_AS
source: Save as new configuration…
ru: Сохранит как новую конфигурацию…

# BACKGROUNDS_DELETE
source: Delete current configuration
ru: Удалить текущую конфигурацию

source: Flat Background
ru: Однородный фон

source: Image Background
ru: Фон-картинка

source: Checkered Background
ru: Фон в клетку

source: Slashed Background
ru: Разлинованный фон

source: Main Background
ru: Основной фон

source: Alternate Background
ru: Дополнительный фон

# PALETTE_SAVE_AS
source: Save as new palette…
ru: Сохранить как новую палитру…

# PALETTE_SET_DEFAULT
source: Set this palette as default
ru: Сделать палитрой по умолчанию

# PALETTE_DELETE
source: Delete current palette
ru: Удалить текущую палитру…

source: Generated Palette
ru: Сгенерированная палитра

source: Crayons
ru: Карандаши (пастель)

source: Web Safe Colors
ru: Web-безопасные цвета

source: Grayscale
ru: Оттенки серого

source: No User Palettes
ru: Нет пользовательских палитр

# NEW_PALETTE_PROMPT
source: Please name the new palette.
ru: Укажите имя для этой палитры

source: Change Palette Color
ru: Изменить цвета палитры

source: Change Palette
ru: Изменить палитру

source: Crash Recovery
ru: Восстановление после сбоя

# CRASH_TEXT
source: Pixen appears to have crashed with unsaved changes the last time it was run. The affected files' backups have been opened for you. If you would like to save them over the original files, you'll have to use "Save As…" and overwrite them.
ru: Pixen экстренно завершил свою работу в предыдущий раз, но успел сделать резервные копии всех ваших несохранённых изменений. Если вы хотите сохранить эти восстановленные файлы вместо оригинальных, воспользуйтесь пунктом «Сохранить как…» из меню «Файл».

source: Width
ru: Ширина

source: W:
ru: Ш:

source: Height
ru: Высота

source: H:
ru: В:

source: Red
ru: Красный

source: Green
ru: Зелёный

source: Blue
ru: Синий

source: Alpha
ru: Альфа

source: Properties
ru: Свойства

source: Left
ru: Левая кнопка

source: Right
ru: Правая кнопка

source: Modify Pattern…
ru: Изменить шаблон…

source: Set Pattern…
ru: Выбрать шаблон…

source: Nearest Neighbor
ru: Поиск ближайшего соседа

# NEAREST_NEIGHBOR_INFO
source: For every pixel in the new image, this algorithm finds the closest pixel in the current image and uses that color. This results in a lossy image if you're not scaling up by a power of two (2x, 4x, 8x, 16x, ...) This algorithm is ideal if you want a larger image that looks identical to the current image.
ru: Для каждого пикселя в новом изображении этот алгоритм находит ближайший пиксель в оригинальном изображении и копирует его. В результате получаются не самые лучше результаты (если вы не масштабируете изображение в «степень двойки» раз, т.е. x2, x4, и т.д). Алгоритм «поиска ближайшего соседа» подходит, если вам нужно просто получить бо́льшую по размеру, но максимально схожую с оригиналом картинку.

# SCALE2X_INFO
source: This algorithm provides a larger, smoother image without introducing new colors. This algorithm may only be used to scale up by powers of two, and it works best for scaling up by 2x in both dimensions.
ru: На выходе этот алгоритм выдаёт бо́льшие по размеру и сглаженные изображения, сохраняя все оригинальные цвета. Его следует использовать только для масштабирования на степень двойки (x2, x4, и т.д).

# QUARTZ_INFO
source: This algorithm uses Quartz's built-in scaling behavior.
ru: Этот алгоритм использует стандартные механизмы из Quartz.

# PENCIL_NAME
source: Pencil Tool
ru: Карандаш

# PENCIL_ACTION
source: Drawing
ru: Простое рисование

# LINE_NAME
source: Line Tool
ru: Линия

# LINE_ACTION
source: Drawing Line
ru: Рисование прямых линий

# ERASER_NAME
source: Eraser Tool
ru: Ластик

# ERASER_ACTION
source: Erasure
ru: Удаление нарисованного

# FILL_NAME
source: Fill Tool
ru: Заливка

# FILL_ACTION
source: Fill
ru: Заливка всего изображения или его части цветом

# EYEDROPPER_NAME
source: Eyedropper Tool
ru: Пипетка

# ZOOM_NAME
source: Zoom Tool
ru: Лупа

# RECTANGULARSELECTION_NAME
source: Rectangular Selection Tool
ru: Прямоугольное выделение

# RECTANGULARSELECTION_ACTION
source: Selection
ru: Да, просто выделение

# SELECTION_MOVE_ACTION
source: Selection Move
ru: Перемещение выделенного фрагмента

# MOVE_NAME
source: Move Tool
ru: Перемещение

# MOVE_ACTION
source: Move
ru: Перемещение всего изображения или выделенной области

# RECTANGLE_NAME
source: Rectangle Tool
ru: Прямоугольник

# RECTANGLE_ACTION
source: Drawing Rectangle
ru: Рисование прямоугольников

# ELLIPSE_NAME
source: Ellipse Tool
ru: Эллипс

# ELLIPSE_ACTION
source: Drawing Ellipse
ru: Рисование эллипсов

# MAGICWAND_NAME
source: Magic Wand Tool
ru: Волшебная палочка

# MAGICWAND_ACTION
source: Selection
ru: Умное выделение

# LASSO_NAME
source: Lasso Tool
ru: Лассо

# LASSO_ACTION
source: Selection
ru: Выделение области произвольной формы

# SHOW_ALIGNMENT_CROSSHAIRS
source: Show Alignment Crosshair
ru: Отображать направляющие линии кисти

# HIDE_ALIGNMENT_CROSSHAIRS
source: Hide Alignment Crosshair
ru: Скрывать направляющие линии кисти

# ALREADY_SYSTEM_PALETTE
source: There is already a system palette by that name.
ru: Палитра с таким именем уже существует. Пожалуйста, выберите другое название.

# PICK_DIFFERENT_NAME
source: Would you like to pick a different name for %@?
ru: Хотите изменить название для «%@»?

# VERSION_STRING
source: Version %@
ru: Версия %@

source: Add Frame
ru: Добавить кадр

source: Hide Previous Frame Overlay
ru: Скрывать предыдущий кадр

source: Show Previous Frame Overlay
ru: Отображать предыдущий кадр

source: Copy Frame
ru: Скопировать кадр

source: Cut Frame
ru: Вырезать кадр

source: Duplicate Frame
ru: Дублировать кадр

source: Delete Frame
ru: Удалить кадр

source: A background with the name %@ already exists.
ru: Шаблон фона с именем «%@» уже существует.

source: Built-in Templates
ru: Встроенные шаблоны

source: Built-in Template
ru: Стандартный

source: Cancel
ru: Отмена

source: Default Templates
ru: Шаблоны по умолчанию

source: Delete
ru: Удалить

source: Overwrite
ru: Заменить

source: Really delete background template %@?
ru: Вы точно хотите удалить шаблон фона «%@»?

source: This operation cannot be undone.
ru: Эта операция не может быть отменена.

source: User Templates
ru: Мои шаблоны

source: Would you like to overwrite it?
ru: Вы действительно хотите заменить его?

source: Drag a template here, and it will be displayed when the mouse is outside of the canvas.
ru: Переместите сюда шаблон, и он будет отображён, когда холст находится не в фокусе.

source: Main Layer
ru: Главный слой

source: The pasted %@ is too big!
ru: Вы пытаетесь вставить %@, чьи размеры превышают размеры холста текущего документа!

source: Resize Canvas to Fit
ru: Увеличить размер холста

source: Cancel Paste
ru: Отменить вставку

source: Paste Anyway
ru: Всё равно вставить

source: The pasted %@ is %dx%d, while the canvas is only %dx%d.
ru: Его размер %dx%d, тогда как размеры холста всего %dx%d.

source: layer
ru: слой

source: image
ru: изображение

source: Pasted Layer
ru: Вставленный слой

source: Copy
ru: Копия

source: %@ Copy
ru: %@ Копия

# Promoted Selection
source: Backgrounds
ru: Выделенный фрагмент

source: Backgrounds
ru: Настройки фона

source: Document Palette
ru: Текущая палитра

source: Default %@
ru: Стандартный %@

source: Default Alternate Background
ru: Вторичный фон по умолчанию

source: Install Background Template "%@"?
ru: Импортировать шаблон фона «%@»?

source: Install
ru: Импорт

source: %@ will be copied to %@.
ru: %@ будет скопирован в %@.

source: Install pattern '%@'?
ru: Импортировать шаблон «%@»?

source: Confirmation
ru: Подтверждение

source: Install palette '%@'?
ru: Импортировать палитру «%@»?

source: Duplicate
ru: Дублировать

source: Merge Down
ru: Объединить с нижними слоями

source: Cut
ru: Вырезать

source: Transform Layer
ru: Изменить слой

source: Flip Horizontally
ru: Отразить по горизонтали

source: Flip Vertically
ru: Отразить по вертикали

source: Rotate 90%@ Left
ru: Повернуть на 90%@ против часовой стрелки

source: Rotate 90%@ Right
ru: Повернуть на 90%@ по часовой стрелке

source: Rotate 180%@
ru: Повернуть на 180%@

source: New Layer %d
ru: Новый слой %d

source: Save Preset As...
ru: Сохранить шаблон как...

source: Manage Presets...
ru: Управление шаблонами...

source: Enter a name for this preset:
ru: Введите имя для этого шаблона:

source: Temp Layer
ru: Временный слой

source: Please name the new configuration.
ru: Укажите имя для нового элемента.

source: No Palettes
ru: Палитр нет. Ни одной.

source: Are you sure you want to delete the palette '%@'?
ru: Вы точно хотите удалить удалить палитру под названием «%@»?

source: Untitled Palette
ru: Безымянная палитра

source: Rename the palette '%@'
ru: Переименовать палитру «%@»

source: Pattern Editor:
ru: Редактирование шаблона:

source: Are you sure you want to delete the selected pattern?
ru: Вы точно хотите удалить выбранный шаблон?

source: Size To...
ru: Масштабировать...

source: Set Background...
ru: Выбрать фон...

source: Backgrounds - Preview
ru: Фон - Предпросмотр

source: Pixen Colors
ru: Цвета Pixen

source: Import
ru: Импорт

source: Export
ru: Экспорт

source: Import Sequence
ru: Серия изображений

source: Exporting GIF... (1 of %ld)
ru: Экспорт в GIF… (1 из %ld)

source: Exporting GIF... (%ld of %ld)
ru: Экспорт в GIF… (%ld из %ld)

source: Error
ru: Проблема, Хьюстон

source: Could not export QuickTime movie.
ru: Не могу экспортировать файл в формат QuickTime видео.

source: Export to:
ru: Экспорт в:

source: Hide Grid
ru: Скрыть сетку

source: Show Grid
ru: Показать сетку

source: Hide Info Bar
ru: Скрыть информационное табло

source: Show Info Bar
ru: Показать информационное табло

source: %ld palette(s) were imported.
ru: Все палитры (всего — %ld) были успешно импортированы.

source: Success
ru: Это успех!

# PixenPaletteType
source: Pixen Palette Format (.pxpalette)
ru: Палитра Pixen (.pxpalette)

# MicrosoftPaletteType
source: Microsoft RAW Palette Format (.pal)
ru: RAW палитра Microsoft (.pal)

# JascPaletteType
source: Jasc Paint Shop Pro Palette Format (.pal)
ru: Палитра Jasc Paint Shop Pro (.pal)

# AdobePaletteType
source: Adobe Color Table (.act)
ru: Таблица цветов Adobe (.act)

# GimpPaletteType
source: Gimp Palette Format (.gpl)
ru: Палитра Gimp(.gpl)

source: Pixen image
ru: Изображение Pixen

source: Pixen animation
ru: Анимация Pixen

source: GIF image
ru: Анимация GIF

source: JPEG image
ru: Изображение JPEG

source: PNG image
ru: Изображение PNG

source: TIFF image
ru: Изображение TIFF

source: BMP image
ru: Изображение BMP
